<!-- add-pr-comment:eks_plan -->

# staging/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_log_metric_filter.celery-error-duplicate-record[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-duplicate-record" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-duplicate-record"
      + pattern                   = "\"CELERY_KNOWN_ERROR::DUPLICATE_RECORD\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-duplicate-record"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-job-incomplete[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-job-incomplete" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-job-incomplete"
      + pattern                   = "\"CELERY_KNOWN_ERROR::JOB_INCOMPLETE\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-job-incomplete"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-notification-not-found[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-notification-not-found" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-notification-not-found"
      + pattern                   = "\"CELERY_KNOWN_ERROR::NOTIFICATION_NOT_FOUND\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-notification-not-found"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-shutdown[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-shutdown" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-shutdown"
      + pattern                   = "\"CELERY_KNOWN_ERROR::SHUTDOWN\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-shutdown"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-throttling[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-throttling" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-throttling"
      + pattern                   = "\"CELERY_KNOWN_ERROR::THROTTLING\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-throttling"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-timeout[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-timeout" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-timeout"
      + pattern                   = "\"CELERY_KNOWN_ERROR::TIMEOUT\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-timeout"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-unknown[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-unknown" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-unknown"
      + pattern                   = "\"CELERY_UNKNOWN_ERROR\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-unknown"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_metric_filter.celery-error-xray[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-error-xray" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name                      = "celery-error-xray"
      + pattern                   = "\"CELERY_KNOWN_ERROR::XRAY\""
      + region                    = "ca-central-1"
      + metric_transformation {
          + name      = "celery-error-xray"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_metric_alarm.logs-1-celery-error-throttling-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-celery-error-throttling-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One Celery throttling error in 1 minute"
      + alarm_name                            = "logs-1-celery-error-throttling-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-throttling"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-10-celery-error-shutdown-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-celery-error-shutdown-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten Celery shutdown errors in 1 minute"
      + alarm_name                            = "logs-10-celery-error-shutdown-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-shutdown"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-duplicate-record-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-duplicate-record-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten Celery duplicate record errors in 1 minute"
      + alarm_name                            = "logs-celery-error-duplicate-record-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-duplicate-record"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-duplicate-record-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-duplicate-record-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One Celery duplicate record error in 1 minute"
      + alarm_name                            = "logs-celery-error-duplicate-record-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-duplicate-record"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-job-incomplete-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-job-incomplete-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten Celery job incomplete errors in 1 minute"
      + alarm_name                            = "logs-celery-error-job-incomplete-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-job-incomplete"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-job-incomplete-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-job-incomplete-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One Celery job incomplete error in 1 minute"
      + alarm_name                            = "logs-celery-error-job-incomplete-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-job-incomplete"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-notification-not-found-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-notification-not-found-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten Celery notification not found errors in 1 minute"
      + alarm_name                            = "logs-celery-error-notification-not-found-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-notification-not-found"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-notification-not-found-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-notification-not-found-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One Celery notification not found error in 1 minute"
      + alarm_name                            = "logs-celery-error-notification-not-found-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-notification-not-found"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-shutdown-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-shutdown-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One Celery shutdown error in 1 minute"
      + alarm_name                            = "logs-celery-error-shutdown-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-shutdown"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-throttling-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-throttling-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten Celery throttling errors in 1 minute"
      + alarm_name                            = "logs-celery-error-throttling-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-throttling"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten Celery timeout errors in 1 minute"
      + alarm_name                            = "logs-celery-error-timeout-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-timeout"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-timeout-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-timeout-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One Celery timeout error in 1 minute"
      + alarm_name                            = "logs-celery-error-timeout-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-timeout"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-unknown-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-unknown-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten unclassified Celery errors in 1 minute"
      + alarm_name                            = "logs-celery-error-unknown-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-unknown"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-unknown-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-unknown-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One unclassified Celery error in 1 minute"
      + alarm_name                            = "logs-celery-error-unknown-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-unknown"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-xray-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-xray-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Ten Celery X-Ray errors in 1 minute"
      + alarm_name                            = "logs-celery-error-xray-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-xray"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-celery-error-xray-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-celery-error-xray-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "One Celery X-Ray error in 1 minute"
      + alarm_name                            = "logs-celery-error-xray-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-error-xray"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 60
      + region                                = "ca-central-1"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
Plan: 24 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---